titanic datasını okuyunuz(<b>train.csv</b>). Ödevin geri kalanında dataframe gösterimlerini <b>display()</b> fonksiyonunu kullanarak yapınız.<br> Örn: display(titanic_df)

In [1]:
import pandas as pd
titanic_df = pd.read_csv('train.csv')
display(titanic_df.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Soru 1:

Kazada ölenlerin yaş ortalamasını bulunuz

In [3]:
titanic_df[titanic_df.Survived==0].Age.mean()

30.62617924528302

Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [4]:
display(titanic_df[titanic_df.Survived==0].Fare.mean())
display(titanic_df[titanic_df.Survived==0].Fare.median())

22.117886885245877

10.5

Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [5]:
dead_man = titanic_df[(titanic_df.Survived==0) & (titanic_df.Sex=='male')]
dead_man.Age.mean()

31.618055555555557

Kazada ölen Kadınların yaş ortalamasını bulunuz

In [6]:
dead_woman = titanic_df[(titanic_df.Survived==0) & (titanic_df.Sex=='female')]
dead_woman.Age.mean()

25.046875

# Soru 2:

Kazadan kurtulanların yaş ortalamasını bulunuz

In [7]:
titanic_df[titanic_df.Survived==1].Age.mean()

28.343689655172415

Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [8]:
titanic_df[titanic_df.Survived==1].Fare.mean()

48.39540760233917

Kazadan kurtulan toplam kişi sayısını bulunuz

In [9]:
len(titanic_df[titanic_df.Survived==1])

342

Kazadan kurtulan erkeklerin yaş ortalamasını bulunuz

In [10]:
saved_man = titanic_df[(titanic_df.Survived==1) & (titanic_df.Sex=='male')]
saved_man.Age.mean()

27.276021505376345

Kazadan kurtulan kadınların yaş ortalamasını bulunuz

In [11]:
saved_woman = titanic_df[(titanic_df.Survived==1) & (titanic_df.Sex=='female')]
saved_woman.Age.mean()

28.84771573604061

# Soru 3:

10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [12]:
titanic_df[titanic_df.Age<10].Fare.median()

27.0

10 yaşından büyüklerin bilet fiyatlarının medyan değerini bulunuz

In [13]:
titanic_df[titanic_df.Age>10].Fare.median()

13.92915

# Soru 5:

1.sınıf, 2.sınıf ve 3.sınıf yolcuların ölüm oranlarını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [14]:
class1 = titanic_df[titanic_df.Pclass==1]
dead1 = titanic_df[(titanic_df.Pclass==1) & (titanic_df.Survived==0)]
class2 = titanic_df[titanic_df.Pclass==2]
dead2 = titanic_df[(titanic_df.Pclass==2) & (titanic_df.Survived==0)]
class3 = titanic_df[titanic_df.Pclass==3]
dead3 = titanic_df[(titanic_df.Pclass==3) & (titanic_df.Survived==0)]

In [15]:
print('1.sınıf yolcu ölüm oranı: % {0:.3f}'.format(len(dead1)*100/len(class1)))
print('2.sınıf yolcu ölüm oranı: % {0:.3f}'.format(len(dead2)*100/len(class2)))
print('3.sınıf yolcu ölüm oranı: % {0:.3f}'.format(len(dead3)*100/len(class3)))

1.sınıf yolcu ölüm oranı: % 37.037
2.sınıf yolcu ölüm oranı: % 52.717
3.sınıf yolcu ölüm oranı: % 75.764

In [16]:
print("1.sınıf yolcuların 2. ve 3. sınıf yolculara göre çok daha az ölüm oranına sahip olduğu görülmüştür.\n1.sınıf yolcuların kurtulmasına öncelik tanındığı çıkarımı yapılabilir. ")

1.sınıf yolcuların 2. ve 3. sınıf yolculara göre çok daha az ölüm oranına sahip olduğu görülmüştür.
1.sınıf yolcuların kurtulmasına öncelik tanındığı çıkarımı yapılabilir.

1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarını karşılaştırınız

In [17]:
display(class1.Fare.describe(),class2.Fare.describe(),class3.Fare.describe())

count    216.000000
mean      84.154687
std       78.380373
min        0.000000
25%       30.923950
50%       60.287500
75%       93.500000
max      512.329200
Name: Fare, dtype: float64

count    184.000000
mean      20.662183
std       13.417399
min        0.000000
25%       13.000000
50%       14.250000
75%       26.000000
max       73.500000
Name: Fare, dtype: float64

count    491.000000
mean      13.675550
std       11.778142
min        0.000000
25%        7.750000
50%        8.050000
75%       15.500000
max       69.550000
Name: Fare, dtype: float64

In [18]:
print('Sınıf seviyesi arttıkça bilet fiyatlarında artış gözlemlenmiştir.')

Sınıf seviyesi arttıkça bilet fiyatlarında artış gözlemlenmiştir.

# Soru 6:

Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [19]:
all_woman = titanic_df[titanic_df.Sex=='female']
all_man = titanic_df[titanic_df.Sex=='male']
print('kadınların ölüm oranı: % {0:.2f}'.format(len(dead_woman)*100/len(all_woman)))
print('erkeklerin ölüm oranı: % {0:.2f}'.format(len(dead_man)*100/len(all_man)))
print("\nKadınların kazadan kurtulma oranı erkeklere göre daha fazla olduğu görülmüştür.\nKurtulma önceliğinin kadınlara verildiği varsayılabilir.")

kadınların ölüm oranı: % 25.80
erkeklerin ölüm oranı: % 81.11

Kadınların kazadan kurtulma oranı erkeklere göre daha fazla olduğu görülmüştür.
Kurtulma önceliğinin kadınlara verildiği varsayılabilir.

# Soru 7:

Kazada ölen erkeklerin ortalama bilet fiyatı ile kurtulan erkeklerin ortalama bilet fiyatını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [20]:
print(dead_man.Fare.mean())
print(saved_man.Fare.mean())
print("\nKurtulan erkeklerin bilet fiyatı ortalaması daha yüksektir.\nBuradan da üst sınıf erkek yolcuların kurtarılırken öncelikli olduğu çıkarımı yapılabilir.")

21.960992948717944
40.82148440366974

Kurtulan erkeklerin bilet fiyatı ortalaması daha yüksektir.
Buradan da üst sınıf erkek yolcuların kurtarılırken öncelikli olduğu çıkarımı yapılabilir.

# Missing Value Doldurma

Bundan sonraki soruları <b>train_missing.csv</b> datasını kullanarak cevaplayınız.

In [21]:
import pandas as pd
missing_data = pd.read_csv('train_missing.csv')
display(missing_data)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [22]:
missing_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp          170
Parch            0
Ticket           0
Fare            91
Cabin          687
Embarked       173
dtype: int64

In [23]:
missing_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          721 non-null float64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           800 non-null float64
Cabin          204 non-null object
Embarked       718 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 83.7+ KB

# Soru 8

Age, Embarked ve Fare değişkenlerini mean/median/mode değerlerini kullanarak değişken tipine uygun olacak şekilde doldurunuz.

In [24]:
print('-Değişken Tipleri-\nAge : Numeric-Continuous \nEmbarked: Categorical-Nominal\nFare : Numeric-Continuous')

-Değişken Tipleri-
Age : Numeric-Continuous
Embarked: Categorical-Nominal
Fare : Numeric-Continuous

In [25]:
missing_df = missing_data.copy()

In [26]:
missing_df.Age = missing_df.Age.fillna(value=missing_df.Age.mean())
missing_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0.0,0,370376,7.7500,NaN,Q

In [27]:
missing_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp          170
Parch            0
Ticket           0
Fare            91
Cabin          687
Embarked       173
dtype: int64

In [28]:
missing_df.Embarked = missing_df.Embarked.fillna(value=missing_df.Embarked.mode()[0])
missing_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0.0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0.0,0,111369,30.0000,C148,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0.0,0,370376,7.7500,NaN,Q

In [29]:
missing_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp          170
Parch            0
Ticket           0
Fare            91
Cabin          687
Embarked         0
dtype: int64

In [30]:
print('Bilet fiyatlarının sınıflara göre ortalaması')
display(missing_df.groupby(['Pclass']).Fare.mean())

Bilet fiyatlarının sınıflara göre ortalaması

Pclass
1    83.221999
2    20.837731
3    13.569212
Name: Fare, dtype: float64

In [31]:
missing_df.Fare = missing_df.Fare.fillna(missing_df.groupby(['Pclass']).Fare.transform('mean'))
missing_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1.0,0,A/5 21171,7.250000,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1.0,0,PC 17599,71.283300,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0.0,0,STON/O2. 3101282,7.925000,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1.0,0,113803,53.100000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0.0,0,373450,8.050000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0.0,0,211536,13.000000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0.0,0,112053,30.000000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1.0,2,W./C. 6607,13.569212,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0.0,0,111369,30.000000,C148,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0.0,0,370376,7.750000,NaN,Q

In [32]:
missing_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp          170
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

# Soru 9

SibSp değişkeni hangi yöntemler ile doldurulabilir, fikir yürütün. Uygun bir yöntem ile doldurun. (SibSp değişkeni kişilerin gemide bulunan kardeş/eş sayısını belirtiyor.)

In [33]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
print("SibSp değişkeni % {:.2f} oranında NaN değeri içerdiği görülmektedir.".format(100*missing_df.SibSp.isnull().sum()/len(missing_df.SibSp)))
print('Buradan yola çıkarak Model Based Imputation yöntemiyle doldurulabilir. Bu yöntemde de KNN kullanılabilir.')

SibSp değişkeni % 19.08 oranında NaN değeri içerdiği görülmektedir.
Buradan yola çıkarak Model Based Imputation yöntemiyle doldurulabilir. Bu yöntemde de KNN kullanılabilir.

In [34]:
missing_df.SibSp.unique()

array([ 1.,  0., nan,  4.,  3.,  2.,  5.,  8.])

In [35]:
display(missing_df.SibSp.value_counts())

0.0    489
1.0    173
2.0     21
4.0     16
3.0     12
8.0      7
5.0      3
Name: SibSp, dtype: int64

In [36]:
from sklearn.neighbors import KNeighborsClassifier
knn = KNeighborsClassifier(n_neighbors=7, weights='distance')

In [37]:
missing = missing_df.copy()

In [38]:
for col in ["Sex", "Ticket","Cabin","Embarked"]:
    missing[col] = missing[col].astype('category')
    missing[col] = missing[col].cat.codes

In [39]:
df_with_null = missing[["Pclass", "Parch", "Fare", "Age","Sex", "Ticket","Cabin","Embarked","SibSp"]]
df_without_null = df_with_null.dropna()

X = df_without_null.iloc[:,:8]
Y = df_without_null.iloc[:,8]

In [40]:
knn.fit(X,Y)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=7, p=2,
                     weights='distance')

In [41]:
test_X =  df_with_null.iloc[:,:8]
display(test_X)

     Pclass  Parch       Fare        Age  Sex  Ticket  Cabin  Embarked
0         3      0   7.250000  22.000000    1     523     -1         2
1         1      0  71.283300  38.000000    0     596     81         0
2         3      0   7.925000  26.000000    0     669     -1         2
3         1      0  53.100000  35.000000    0      49     55         2
4         3      0   8.050000  35.000000    1     472     -1         2
..      ...    ...        ...        ...  ...     ...    ...       ...
886       2      0  13.000000  27.000000    1     101     -1         2
887       1      0  30.000000  19.000000    0      14     30         2
888       3      2  13.569212  29.699118    0     675     -1         2
889       1      0  30.000000  26.000000    1       8     60         2
890       3      0   7.750000  32.000000    1     466     -1         1

[891 rows x 8 columns]

In [42]:
knn.predict(test_X)
filled_sib = pd.Series(knn.predict(test_X))
df_with_null.SibSp.fillna(filled_sib, inplace=True)

C:\Users\Admin\Anaconda3\lib\site-packages\pandas\core\generic.py:6287: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [43]:
df_with_null.SibSp.isnull().sum()

0

In [44]:
print('SibSp kolonunun önceki ve sonraki hali')
display(missing_df.SibSp.value_counts(), df_with_null.SibSp.value_counts())

SibSp kolonunun önceki ve sonraki hali

0.0    489
1.0    173
2.0     21
4.0     16
3.0     12
8.0      7
5.0      3
Name: SibSp, dtype: int64

0.0    619
1.0    205
2.0     23
4.0     17
3.0     13
8.0      9
5.0      5
Name: SibSp, dtype: int64

# Soru 10

Datayı baştan okuyun. Embarked değişkenini "NAN" şeklinde yeni bir kategorisi olacak şekilde doldurun.

In [45]:
titanic_data = pd.read_csv('train_missing.csv')
display(titanic_data)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [46]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp          170
Parch            0
Ticket           0
Fare            91
Cabin          687
Embarked       173
dtype: int64

In [47]:
titanic_data.Embarked.unique()

array(['S', 'C', nan, 'Q'], dtype=object)

In [48]:
titanic_data.Embarked.value_counts()

S    529
C    128
Q     61
Name: Embarked, dtype: int64

In [49]:
titanic_data.Embarked.fillna(value="NAN", inplace=True)
display(titanic_data.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NAN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NAN

# Soru 11

"Fare" değişkeni için "Fare_Missing" adında yeni bir değişken türetip "Fare" değişkenini median ile doldurun.

In [50]:
titanic_data.insert(10,'Fare_Missing',0)

In [51]:
na_indices = titanic_data.Fare[titanic_data.Fare.isnull()].index.to_list()
titanic_data.loc[na_indices,'Fare_Missing'] = 1
display(titanic_data[10:15])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Fare_Missing,Cabin,Embarked
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1.0,1,PP 9549,16.7000,0,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0.0,0,113783,NaN,1,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0.0,0,A/5. 2151,NaN,1,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1.0,5,347082,31.2750,0,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,NaN,0,350406,7.8542,0,NaN,NAN

In [52]:
titanic_data.Fare.fillna(titanic_data.Fare.median(), inplace=True)
display(titanic_data[10:15])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Fare_Missing,Cabin,Embarked
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1.0,1,PP 9549,16.70000,0,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0.0,0,113783,14.45625,1,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0.0,0,A/5. 2151,14.45625,1,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1.0,5,347082,31.27500,0,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,NaN,0,350406,7.85420,0,NaN,NAN